{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_108","layers":[{"class_name":"Conv1D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D215","trainable":true,"batch_input_shape":[null,48,1],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization322","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.1,"name":"leaky_re_lu_LeakyReLU322","trainable":true}},{"class_name":"Conv1D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D216","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization323","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.1,"name":"leaky_re_lu_LeakyReLU323","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten108","trainable":true}},{"class_name":"Dense","config":{"units":256,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense215","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization324","trainable":true}},{"class_name":"LeakyReLU","config":{"alpha":0.1,"name":"leaky_re_lu_LeakyReLU324","trainable":true}},{"class_name":"Dense","config":{"units":12,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense216","trainable":true}}]},"keras_version":"tfjs-layers 4.8.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1d_Conv1D215/kernel","shape":[5,1,128],"dtype":"float32"},{"name":"conv1d_Conv1D215/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization322/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization322/beta","shape":[128],"dtype":"float32"},{"name":"conv1d_Conv1D216/kernel","shape":[3,128,64],"dtype":"float32"},{"name":"conv1d_Conv1D216/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization323/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization323/beta","shape":[64],"dtype":"float32"},{"name":"dense_Dense215/kernel","shape":[2688,256],"dtype":"float32"},{"name":"dense_Dense215/bias","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization324/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization324/beta","shape":[256],"dtype":"float32"},{"name":"dense_Dense216/kernel","shape":[256,12],"dtype":"float32"},{"name":"dense_Dense216/bias","shape":[12],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization322/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization322/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization323/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization323/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization324/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization324/moving_variance","shape":[256],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.8.0","convertedBy":null}